In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("./Dataset/preprocessed_dataset_v2.csv", index_col=0)

In [3]:
data.head()

,Year,Month,Day,Hour,Minute,Payment Method,Amount,Category,Is Fraud?
0,2002,9,1,6,21,on-site,134.09,Personal Spending,No
1,2002,9,1,6,42,on-site,38.48,Food/Groceries,No
2,2002,9,2,6,22,on-site,120.34,Food/Groceries,No
3,2002,9,2,17,45,on-site,128.95,Clothing,No
4,2002,9,3,6,23,on-site,104.71,Healthcare,No

In [4]:
data.drop(["Day", "Hour", "Minute", "Payment Method"], axis=1, inplace=True)

In [5]:
data.head()

   Year  Month  Amount           Category Is Fraud?
0  2002      9  134.09  Personal Spending        No
1  2002      9   38.48     Food/Groceries        No
2  2002      9  120.34     Food/Groceries        No
3  2002      9  128.95           Clothing        No
4  2002      9  104.71         Healthcare        No

In [6]:
data.shape

(23998449, 5)

In [7]:
# drop the rows where the "Is Fraud?" value is "Yes"
data = data[data["Is Fraud?"] != "Yes"]

In [8]:
data.shape

(23969978, 5)

In [9]:
data.drop(["Is Fraud?"], axis=1, inplace=True)

In [10]:
data

          Year  Month  Amount           Category
0         2002      9  134.09  Personal Spending
1         2002      9   38.48     Food/Groceries
2         2002      9  120.34     Food/Groceries
3         2002      9  128.95           Clothing
4         2002      9  104.71         Healthcare
...        ...    ...     ...                ...
23998444  2020      2  -54.00     Transportation
23998445  2020      2   54.00     Transportation
23998446  2020      2   59.15     Transportation
23998447  2020      2   43.12     Transportation
23998448  2020      2   45.13        Restaurants

[23969978 rows x 4 columns]

In [11]:
grouped = data.groupby(['Year', 'Month', 'Category']).agg(
    Frequency=('Amount', 'count'),  # Count the number of transactions
    TotalAmount=('Amount', 'sum')   # Sum the amount of transactions
).reset_index()

In [12]:
print(data['Year'].unique())
print(grouped['Year'].unique())

[2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015
 2016 2017 2018 2019 2020 1999 2000 2001 1998 1996 1997 1995 1994 1991
 1992 1993]
[1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004
 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018
 2019 2020]

In [13]:
grouped.to_csv('./dataset/monthly_category_expenses.csv')